Revit 2027 API
EmbodiedCarbonAsset.ProviderId Property
 Internal identifier of provider, which provide embodied carbon data. List of available providers can be retrieved from Sustainability API.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProviderId { get; }
Public ReadOnly Property ProviderId As String
	Get
public:
property String^ ProviderId {
	String^ get ();
}
member ProviderId : string with get
Property Value
String
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace